Repository: lxd930808/LinguaCast
Catalog: ios/PodcastEnglishStudio/PodcastEnglishStudio/Support/Localizable.xcstrings
Source language: en
Languages: ar, de, es, fr, ja, ko, pt_br, zh_hans, zh_hant

# mobile_setup.same_network
source: iPhone and Apple TV must be connected to the same local network.
ar: يجب أن يكون iPhone وApple TV متصلين بنفس شبكة LAN.
de: iPhone und Apple TV müssen mit demselben LAN verbunden sein.
es: iPhone y Apple TV deben estar conectados a la misma LAN.
fr: iPhone et Apple TV doivent être connectés au même réseau local.
ja: iPhone と Apple TV は同じ LAN に接続する必要があります。
ko: iPhone와 Apple TV는 동일한 LAN에 연결되어 있어야 합니다.
pt_br: iPhone e Apple TV precisam estar conectados à mesma LAN.
zh_hans: iPhone 和 Apple TV 需要连接同一个局域网。
zh_hant: iPhone 和 Apple TV 需要連接同一個區域網路。

# mobile_setup.scan_code_with_mobile_phone_to_fill_in
source: Scan code with mobile phone to fill in
ar: قم بمسح الرمز ضوئيًا باستخدام الهاتف المحمول لملء البيانات
de: Zum Ausfüllen den Code mit dem Mobiltelefon scannen
es: Escanee el código con el teléfono móvil para completarlo
fr: Scannez le code avec votre téléphone portable pour le remplir
ja: 携帯電話でコードをスキャンして入力します
ko: 휴대폰으로 코드를 스캔하여 작성하세요.
pt_br: Digitalize o código com o celular para preencher
zh_hans: 手机扫码填写
zh_hant: 手機掃碼填寫

# mobile_setup.scan_instructions
source: Scan with the iPhone camera, then configure APIs, Podcast subscriptions, or YouTube channels in Safari.
ar: امسح الرمز ضوئيًا باستخدام الكاميرا iPhone واملأ إعدادات API أو اشتراك البودكاست أو قناة YouTube في Safari.
de: Scannen Sie den Code mit der iPhone-Kamera und geben Sie die API-Einstellungen, das Podcast-Abonnement oder den YouTube-Kanal in Safari ein.
es: Escanee el código con la cámara iPhone y complete la configuración de API, suscripción a podcast o canal YouTube en Safari.
fr: Scannez le code avec la caméra iPhone et renseignez les paramètres API, l'abonnement au podcast ou la chaîne YouTube dans Safari.
ja: iPhone カメラでコードをスキャンし、API 設定、ポッドキャスト購読、または YouTube チャンネルを Safari に入力します。
ko: iPhone 카메라로 코드를 스캔하고 Safari에서 API 설정, 팟캐스트 구독 또는 YouTube 채널을 입력하세요.
pt_br: Digitalize o código com a câmera iPhone e preencha as configurações do API, assinatura de podcast ou canal YouTube em Safari.
zh_hans: 用 iPhone 相机扫码，在 Safari 里填写 API 设置、播客订阅或 YouTube 频道。
zh_hant: 用 iPhone 相機掃碼，在 Safari 裡填寫 API 設定、播客訂閱或 YouTube 頻道。

# mobile_setup.settings_saved
source: Settings saved
ar: تم حفظ الإعدادات
de: Einstellungen gespeichert
es: Configuración guardada
fr: Paramètres enregistrés
ja: 設定が保存されました
ko: 설정이 저장되었습니다.
pt_br: Configurações salvas
zh_hans: 设置已保存
zh_hant: 設定已儲存

# mobile_setup.unable_to_generate_qr_code
source: Unable to generate QR code
ar: غير قادر على إنشاء رمز الاستجابة السريعة
de: QR-Code kann nicht generiert werden
es: No se puede generar el código QR
fr: Impossible de générer le code QR
ja: QRコードを生成できません
ko: QR 코드를 생성할 수 없습니다
pt_br: Não foi possível gerar o código QR
zh_hans: 无法生成二维码
zh_hant: 無法產生二維碼

# mobile_setup.waiting_for_lan_address
source: Waiting for LAN address
ar: في انتظار عنوان LAN
de: Warten auf LAN-Adresse
es: Esperando dirección LAN
fr: En attente de l'adresse LAN
ja: LANアドレスを待っています
ko: LAN 주소를 기다리는 중
pt_br: Aguardando endereço LAN
zh_hans: 等待局域网地址
zh_hant: 等待區域網路位址

# mobile_setup.youtube_channel_has_been_added
source: YouTube Channel has been added
ar: YouTube تمت إضافة القناة
de: YouTube Kanal wurde hinzugefügt
es: YouTube Se ha agregado el canal
fr: La chaîne YouTube a été ajoutée
ja: YouTube チャンネルが追加されました
ko: YouTube 채널이 추가되었습니다
pt_br: YouTube O canal foi adicionado
zh_hans: YouTube 频道已添加
zh_hant: YouTube 頻道已新增

# navigation.assistant
source: Assistant
ar: المساعد
de: Assistent
es: Asistente
ja: アシスタント
ko: 어시스턴트
pt_br: Assistente
zh_hans: 助手
zh_hant: 助手

# navigation.home
source: Home
ar: الرئيسية
de: Start
es: Inicio
fr: Accueil
ja: ホーム
ko: 홈
pt_br: Início
zh_hans: 首页
zh_hant: 首頁

# navigation.programs
source: Programs
ar: البرامج
de: Sendungen
es: Programas
fr: Programmes
ja: 番組
ko: 프로그램
pt_br: Programas
zh_hans: 节目
zh_hant: 節目

# navigation.settings
source: Settings
ar: الإعدادات
de: Einstellungen
es: Ajustes
fr: Réglages
ja: 設定
ko: 설정
pt_br: Ajustes
zh_hans: 设置
zh_hant: 設定

# navigation.subscriptions
source: Subscriptions
ar: الاشتراكات
de: Abonnements
es: Suscripciones
fr: Abonnements
ja: 購読
ko: 구독
pt_br: Assinaturas
zh_hans: 订阅
zh_hant: 訂閱

# pipeline.asr.downloading_result
source: Downloading transcription result
ar: جارٍ تنزيل نتيجة النسخ
de: Transkriptionsergebnis wird heruntergeladen
es: Descargando resultado de transcripción
fr: Téléchargement du résultat de transcription
ja: 文字起こし結果をダウンロード中
ko: 음성 변환 결과 다운로드 중
pt_br: Baixando resultado da transcrição
zh_hans: 正在下载转写结果
zh_hant: 正在下載轉寫結果

# pipeline.asr.parsing_result
source: Parsing transcription result
ar: جارٍ تحليل نتيجة النسخ
de: Transkriptionsergebnis wird verarbeitet
es: Procesando resultado de transcripción
fr: Analyse du résultat de transcription
ja: 文字起こし結果を解析中
ko: 음성 변환 결과 분석 중
pt_br: Processando resultado da transcrição
zh_hans: 正在解析转写结果
zh_hant: 正在解析轉寫結果

# pipeline.asr.polling
source: Transcribing audio in the cloud
ar: جارٍ نسخ الصوت في السحابة
de: Audio wird in der Cloud transkribiert
es: Transcribiendo audio en la nube
fr: Transcription audio dans le cloud
ja: クラウドで音声を文字起こし中
ko: 클라우드에서 음성을 텍스트로 변환 중
pt_br: Transcrevendo áudio na nuvem
zh_hans: 云端语音转文字
zh_hant: 雲端語音轉文字

# pipeline.asr.preparing_upload
source: Preparing audio upload
ar: جارٍ تحضير رفع الصوت
de: Audio-Upload wird vorbereitet
es: Preparando la carga de audio
fr: Préparation du téléversement audio
ja: 音声アップロードを準備中
ko: 오디오 업로드 준비 중
pt_br: Preparando o envio do áudio
zh_hans: 正在准备上传音频
zh_hant: 正在準備上傳音訊

# pipeline.asr.submitting
source: Submitting transcription task
ar: جارٍ إرسال مهمة النسخ
de: Transkriptionsauftrag wird gesendet
es: Enviando tarea de transcripción
fr: Envoi de la tâche de transcription
ja: 文字起こしタスクを送信中
ko: 음성 변환 작업 제출 중
pt_br: Enviando tarefa de transcrição
zh_hans: 正在提交转写任务
zh_hant: 正在提交轉寫任務

# pipeline.asr.uploading_audio
source: Uploading audio
ar: جارٍ رفع الصوت
de: Audio wird hochgeladen
es: Subiendo audio
fr: Téléversement de l’audio
ja: 音声をアップロード中
ko: 오디오 업로드 중
pt_br: Enviando áudio
zh_hans: 正在上传音频
zh_hant: 正在上傳音訊

# pipeline.download.progress_known
source: Downloading source audio %@/%@
ar: تنزيل الصوت المصدر %@/%@
de: Quellaudio wird heruntergeladen %@/%@
es: Descargando audio fuente %@/%@
fr: Téléchargement de la source audio %@/%@
ja: ソースオーディオのダウンロード %@/%@
ko: 소스 오디오 %@/%@ 다운로드 중
pt_br: Baixando fonte de áudio %@/%@
zh_hans: 下载源音频 %@/%@
zh_hant: 下載來源音訊 %@/%@

# pipeline.download.progress_unknown
source: Downloading source audio %@
ar: تنزيل مصدر الصوت %@
de: Quellaudio wird heruntergeladen %@
es: Descargando audio fuente %@
fr: Téléchargement de la source audio %@
ja: ソースオーディオのダウンロード %@
ko: 소스 오디오 %@ 다운로드 중
pt_br: Baixando fonte de áudio %@
zh_hans: 下载源音频 %@
zh_hant: 下載來源音訊 %@

# pipeline.step.build
source: Building Subtitles
ar: إنشاء الترجمات
de: Untertitel erstellen
es: Creando subtítulos
fr: Création des sous-titres
ja: 字幕を作成中
ko: 자막 생성 중
pt_br: Criando legendas
zh_hans: 生成双语字幕
zh_hant: 產生雙語字幕

# pipeline.step.completed
source: Completed
ar: اكتمل
de: Abgeschlossen
es: Completado
fr: Terminé
ja: 完了
ko: 완료됨
pt_br: Concluído
zh_hans: 已完成
zh_hant: 已完成

# pipeline.step.download
source: Downloading Audio
ar: تنزيل الصوت
de: Audio laden
es: Descargando audio
fr: Téléchargement de l’audio
ja: 音声をダウンロード中
ko: 오디오 다운로드 중
pt_br: Baixando áudio
zh_hans: 下载音频
zh_hant: 下載音訊

# pipeline.step.preparing
source: Preparing
ar: جارٍ التحضير
de: Vorbereiten
es: Preparando
fr: Préparation
ja: 準備中
ko: 준비 중
pt_br: Preparando
zh_hans: 准备中
zh_hant: 準備中

# pipeline.step.segment_source
source: Optimizing Subtitle Breaks
ar: تحسين فواصل الترجمة
de: Untertitel-Absätze werden optimiert
es: Optimizando saltos de subtítulos
fr: Optimisation des coupures de sous-titres
ja: 字幕の区切りを最適化中
ko: 자막 끊기 최적화 중
pt_br: Otimizando quebras de legendas
zh_hans: 正在优化字幕断句
zh_hant: 正在優化字幕斷句

# pipeline.step.transcribe
source: Transcribing Audio
ar: نسخ الصوت
de: Audio transkribieren
es: Transcribiendo audio
fr: Transcription de l’audio
ja: 音声を文字起こし中
ko: 오디오 받아쓰기 중
pt_br: Transcrevendo áudio
zh_hans: 语音转文字
zh_hant: 語音轉文字

# pipeline.step.translate
source: Translating Subtitles
ar: ترجمة النصوص
de: Untertitel übersetzen
es: Traduciendo subtítulos
fr: Traduction des sous-titres
ja: 字幕を翻訳中
ko: 자막 번역 중
pt_br: Traduzindo legendas
zh_hans: 翻译字幕
zh_hant: 翻譯字幕

# pipeline.step.upload
source: Uploading Audio
ar: رفع الصوت
de: Audio hochladen
es: Subiendo audio
fr: Envoi de l’audio
ja: 音声をアップロード中
ko: 오디오 업로드 중
pt_br: Enviando áudio
zh_hans: 上传音频
zh_hant: 上傳音訊

# playback.error.save_completion
source: Failed to save playback completion: %@
ar: فشل حفظ حالة إكمال التشغيل: %@
de: Der Abschlussstatus der Wiedergabe konnte nicht gespeichert werden: %@
es: No se pudo guardar el estado de finalización de la reproducción: %@
fr: Échec de l'enregistrement de l'état de fin de lecture : %@
ja: 再生完了ステータスの保存に失敗しました: %@
ko: 재생 완료 상태 저장 실패: %@
pt_br: Falha ao salvar o status de conclusão da reprodução: %@
zh_hans: 播放完成状态保存失败：%@
zh_hant: 播放完成狀態儲存失敗：%@

# playback.error.save_duration
source: Failed to save playback duration: %@
ar: فشل حفظ مدة التشغيل: %@
de: Wiedergabedauer konnte nicht gespeichert werden: %@
es: No se pudo guardar la duración de la reproducción: %@
fr: Échec de l'enregistrement de la durée de lecture : %@
ja: 再生時間を保存できませんでした: %@
ko: 재생 시간을 저장하지 못했습니다: %@
pt_br: Falha ao salvar a duração da reprodução: %@
zh_hans: 播放时长保存失败：%@
zh_hant: 播放時長儲存失敗：%@

# playback.error.save_position
source: Failed to save playback position: %@
ar: فشل حفظ تقدم التشغيل: %@
de: Wiedergabefortschritt konnte nicht gespeichert werden: %@
es: No se pudo guardar el progreso de la reproducción: %@
fr: Échec de l'enregistrement de la progression de la lecture : %@
ja: 再生の進行状況を保存できませんでした: %@
ko: 재생 진행 상황을 저장하지 못했습니다: %@
pt_br: Falha ao salvar o progresso da reprodução: %@
zh_hans: 播放进度保存失败：%@
zh_hant: 播放進度儲存失敗：%@

# playback.group.chinese
source: Chinese Audio
ar: الصوت الصيني
de: Chinesische Sprachausgabe
es: Audio en chino
fr: Audio chinois
ja: 中国語音声
ko: 중국어 음성
pt_br: Áudio em chinês
zh_hans: 中文配音
zh_hant: 中文配音

# playback.group.episode
source: This Episode
ar: هذه الحلقة
de: Diese Folge
es: Este episodio
fr: Cet épisode
ja: このエピソード
ko: 이 에피소드
pt_br: Este episódio
zh_hans: 本集
zh_hant: 本集

# playback.position
source: Played to %@
ar: تشغيل على %@
de: Spielen Sie zu %@
es: Reproducir a %@
fr: Jouer sur %@
ja: %@ まで再生
ko: %@로 재생
pt_br: Jogue para %@
zh_hans: 播放到 %@
zh_hant: 播放到 %@

# playback.progress
source: Played %@
ar: تم تشغيل %@
de: %@ abgespielt
es: %@ reproducido
fr: %@ lu
ja: %@ 再生済み
ko: %@ 재생함
pt_br: %@ reproduzido
zh_hans: 已播放 %@
zh_hant: 已播放 %@

# playback.settings.title
source: Playback Settings
ar: إعدادات التشغيل
de: Wiedergabeeinstellungen
es: Ajustes de reproducción
fr: Réglages de lecture
ja: 再生設定
ko: 재생 설정
pt_br: Ajustes de reprodução
zh_hans: 播放设置
zh_hant: 播放設定

# playback.subtitle.presentation
source: Subtitle Size and Order
ar: حجم الترجمة وترتيبها
de: Untertitelgröße und Reihenfolge
es: Tamaño y orden de subtítulos
fr: Taille et ordre des sous-titres
ja: 字幕サイズと順序
ko: 자막 크기 및 순서
pt_br: Tamanho e ordem das legendas
zh_hans: 字幕字号与顺序
zh_hant: 字幕字級與順序

# player.back_15_seconds
source: Back 15 Seconds
ar: الرجوع 15 ثانية
de: 15 Sekunden zurück
es: Retroceder 15 segundos
fr: Reculer de 15 secondes
ja: 15秒戻る
ko: 15초 뒤로
pt_br: Voltar 15 segundos
zh_hans: 后退 15 秒
zh_hant: 倒退 15 秒

# player.collapse_controls
source: Collapse Playback Controls
ar: طي عناصر التحكم في التشغيل
de: Wiedergabesteuerung ausblenden
es: Ocultar controles de reproducción
fr: Masquer les commandes de lecture
ja: 再生コントロールを折りたたむ
ko: 재생 컨트롤 접기
pt_br: Recolher controles de reprodução
zh_hans: 收起播放控制
zh_hant: 收合播放控制

# player.expand_controls
source: Expand Playback Controls
ar: توسيع عناصر التحكم في التشغيل
de: Wiedergabesteuerung einblenden
es: Mostrar controles de reproducción
fr: Afficher les commandes de lecture
ja: 再生コントロールを展開
ko: 재생 컨트롤 펼치기
pt_br: Expandir controles de reprodução
zh_hans: 展开播放控制
zh_hant: 展開播放控制

# player.forward_15_seconds
source: Forward 15 Seconds
ar: التقدم 15 ثانية
de: 15 Sekunden vor
es: Avanzar 15 segundos
fr: Avancer de 15 secondes
ja: 15秒進む
ko: 15초 앞으로
pt_br: Avançar 15 segundos
zh_hans: 前进 15 秒
zh_hant: 前進 15 秒

# player.return_to_playback_position
source: Return to Playback Position
ar: العودة إلى موضع التشغيل
de: Zur Wiedergabeposition
es: Volver a la posición de reproducción
fr: Revenir à la position de lecture
ja: 再生位置に戻る
ko: 재생 위치로 돌아가기
pt_br: Voltar à posição de reprodução
zh_hans: 回到播放位置
zh_hant: 回到播放位置

source: Podcast artwork
ar: غلاف البودكاست
de: Podcast-Cover
es: Portada del pódcast
fr: Illustration du podcast
ja: Podcastアートワーク
ko: 팟캐스트 아트워크
pt_br: Capa do podcast
zh_hans: 播客封面
zh_hant: Podcast 封面

# podcast.episode_number
source: Episode %@
ar: الحلقة %@
de: Folge %@
es: Episodio %@
fr: Épisode %@
ja: エピソード %@
ko: 에피소드 %@
pt_br: Episódio %@
zh_hans: 第 %@ 期
zh_hant: 第 %@ 集

# podcast.open_episode_website
source: Open episode website
ar: فتح صفحة الحلقة
de: Folgenseite öffnen
es: Abrir la página del episodio
fr: Ouvrir la page de l’épisode
ja: エピソードのWebサイトを開く
ko: 에피소드 웹사이트 열기
pt_br: Abrir site do episódio
zh_hans: 打开单集网页
zh_hant: 開啟單集網頁

# podcast.open_in_apple_podcasts
source: Listen on Apple Podcasts
ar: الاستماع على Apple Podcasts
de: In Apple Podcasts anhören
es: Escuchar en Apple Podcasts
fr: Écouter sur Apple Podcasts
ja: Apple Podcastsで聴く
ko: Apple Podcasts에서 듣기
pt_br: Ouvir no Apple Podcasts
zh_hans: 在 Apple Podcasts 中收听
zh_hant: 在 Apple Podcasts 中收聽

# podcast.open_website
source: Open podcast website
ar: فتح موقع البودكاست
de: Podcast-Website öffnen
es: Abrir el sitio del pódcast
fr: Ouvrir le site du podcast
ja: PodcastのWebサイトを開く
ko: 팟캐스트 웹사이트 열기
pt_br: Abrir site do podcast
zh_hans: 打开播客网站
zh_hant: 開啟 Podcast 網站

# podcast.season_episode
source: S%@ E%@
ar: الموسم %@ الحلقة %@
de: S%@ F%@
es: T%@ E%@
ja: シーズン%@ エピソード%@
ko: 시즌 %@ 에피소드 %@
pt_br: T%@ E%@
zh_hans: 第 %@ 季 · 第 %@ 期
zh_hant: 第 %@ 季 · 第 %@ 集

# podcast.show_less
source: Show less
ar: عرض أقل
de: Weniger anzeigen
es: Mostrar menos
fr: Afficher moins
ja: 閉じる
ko: 간략히 보기
pt_br: Mostrar menos
zh_hans: 收起
zh_hant: 收合

# podcast.show_more
source: Show more
ar: عرض المزيد
de: Mehr anzeigen
es: Mostrar más
fr: Afficher plus
ja: さらに表示
ko: 더 보기
pt_br: Mostrar mais
zh_hans: 展开
zh_hant: 展開

# root.configuration_completed
source: Configuration completed
ar: اكتمل التكوين
de: Konfiguration abgeschlossen
es: Configuración completada
fr: Configuration terminée
ja: 設定が完了しました
ko: 구성 완료
pt_br: Configuração concluída
zh_hans: 配置已完成
zh_hant: 配置已完成

# root.fill_in_the_youtube_dashscope_and_translation_api_key_first_to_a
source: Fill in the YouTube, DashScope and translation API Key first to avoid failure after adding or refreshing.
ar: املأ المفتاح YouTube وDashScope والترجمة API أولاً لتجنب الفشل بعد الإضافة أو التحديث.
de: Geben Sie zuerst den Schlüssel YouTube, DashScope und die Übersetzung API ein, um Fehler nach dem Hinzufügen oder Aktualisieren zu vermeiden.
es: Complete primero la clave YouTube, DashScope y la traducción API para evitar fallas después de agregar o actualizar.
fr: Remplissez d'abord les clés YouTube, DashScope et la traduction API pour éviter un échec après l'ajout ou l'actualisation.
ja: 追加または更新後の失敗を避けるために、最初に YouTube、DashScope および翻訳キー API を入力してください。
ko: 추가 또는 새로 고침 후 실패를 방지하려면 먼저 YouTube, DashScope 및 번역 API 키를 입력하세요.
pt_br: Preencha a chave YouTube, DashScope e a tradução API primeiro para evitar falhas após adicionar ou atualizar.
zh_hans: 先填写 YouTube、DashScope 和翻译 API Key，避免添加或刷新后才失败。
zh_hant: 先填寫 YouTube、DashScope 和翻譯 API Key，避免加入或刷新後才失敗。

# root.go_to_settings_api_key
source: Go to Settings API Key
ar: انتقل إلى الإعدادات API مفتاح
de: Gehen Sie zu Einstellungen API-Taste
es: Vaya a Configuración API Tecla
fr: Allez dans Paramètres API Clé
ja: 設定に移動 API キー
ko: 설정 API 키로 이동
pt_br: Vá para Configurações API Chave
zh_hans: 去设置 API Key
zh_hant: 去設定 API Key

# root.podcast_bilingual_subtitle_generation_requires_dashscope_and_tra
source: Podcast Bilingual subtitle generation requires DashScope and translation API Key.
ar: Podcast يتطلب إنشاء الترجمة ثنائية اللغة DashScope والترجمة API مفتاح.
de: Podcast Die Erzeugung zweisprachiger Untertitel erfordert den Schlüssel DashScope und die Übersetzung API.
es: Podcast La generación de subtítulos bilingües requiere DashScope y clave de traducción API.
fr: Podcast La génération de sous-titres bilingues nécessite DashScope et la traduction API Key.
ja: Podcast バイリンガル字幕の生成には、DashScope と翻訳 API キーが必要です。
ko: Podcast 이중 언어 자막 생성에는 DashScope 및 번역 API 키가 필요합니다.
pt_br: Podcast A geração de legendas bilíngues requer DashScope e tradução API Key.
zh_hans: Podcast 双语字幕生成需要 DashScope 和翻译 API Key。
zh_hant: Podcast 雙語字幕生成需要 DashScope 和翻譯 API Key。

# root.subscriptions_can_be_added_content_refreshed_and_bilingual_subti
source: Subscriptions can be added, content refreshed, and bilingual subtitles generated.
ar: يمكن إضافة الاشتراكات وتحديث المحتوى وإنشاء ترجمات ثنائية اللغة.
de: Es können Abonnements hinzugefügt, Inhalte aktualisiert und zweisprachige Untertitel generiert werden.
es: Se pueden agregar suscripciones, actualizar el contenido y generar subtítulos bilingües.
fr: Des abonnements peuvent être ajoutés, du contenu actualisé et des sous-titres bilingues générés.
ja: 購読の追加、コンテンツの更新、二か国語字幕の生成が可能です。
ko: 구독을 추가하고, 콘텐츠를 새로 고치고, 이중 언어 자막을 생성할 수 있습니다.
pt_br: Assinaturas podem ser adicionadas, conteúdo atualizado e legendas bilíngues geradas.
zh_hans: 可以添加订阅、刷新内容并生成双语字幕。
zh_hant: 可新增訂閱、刷新內容並產生雙語字幕。

# root.translation_api_key
source: Translation API Key
ar: الترجمة API مفتاح
de: Übersetzung API Schlüssel
es: Traducción API Clave
fr: Traduction API Clé
ja: 翻訳 API キー
ko: 번역 API 키
pt_br: Tradução API Chave
zh_hans: 翻译 API Key
zh_hant: 翻譯 API Key

# root.youtube_channel_list_requires_youtube_data_api_key
source: YouTube Channel list requires YouTube Data API Key.
ar: YouTube قائمة القنوات تتطلب YouTube بيانات API مفتاح.
de: YouTube Kanalliste erfordert YouTube Daten API Schlüssel.
es: YouTube La lista de canales requiere YouTube Datos API Clave.
fr: YouTube La liste des chaînes nécessite YouTube Données API Clé.
ja: YouTube チャンネルリストには YouTube データ API キーが必要です。
ko: YouTube 채널 목록에는 YouTube 데이터 API 키가 필요합니다.
pt_br: YouTube A lista de canais requer YouTube Dados API Chave.
zh_hans: YouTube 频道列表需要 YouTube Data API Key。
zh_hant: YouTube 頻道清單需要 YouTube Data API Key。

# settings.about.device
source: Device
ar: الجهاز
de: Gerät
es: Dispositivo
fr: Appareil
ja: デバイス
ko: 기기
pt_br: Dispositivo
zh_hans: 设备
zh_hant: 裝置

# settings.about.device.help
source: The device model identifier.
ar: معرّف طراز الجهاز.
de: Die Modellkennung des Geräts.
es: Identificador del modelo del dispositivo.
fr: Identifiant du modèle d’appareil.
ja: デバイスのモデル識別子です。
ko: 기기 모델 식별자입니다.
pt_br: Identificador do modelo do dispositivo.
zh_hans: 设备型号标识。
zh_hant: 裝置型號識別碼。

# settings.about.error.help
source: The last settings save error, if any.
ar: آخر خطأ عند حفظ الإعدادات، إن وُجد.
de: Der letzte Fehler beim Speichern der Einstellungen, falls vorhanden.
es: El último error al guardar ajustes, si lo hay.
fr: La dernière erreur d’enregistrement des réglages, le cas échéant.
ja: 設定の保存で発生した直近のエラーです。
ko: 설정 저장 시 발생한 최근 오류입니다.
pt_br: O último erro ao salvar ajustes, se houver.
zh_hans: 最近一次保存设置时的错误（如有）。
zh_hant: 最近一次儲存設定時的錯誤（如有）。

# settings.about.jobs.help
source: Remote generation jobs that have not finished.
ar: مهام التوليد السحابي التي لم تكتمل بعد.
de: Remote-Generierungsaufträge, die noch nicht fertig sind.
es: Tareas de generación remota que no han terminado.
fr: Tâches de génération distantes qui ne sont pas terminées.
ja: 未完了のクラウド生成ジョブです。
ko: 아직 끝나지 않은 클라우드 생성 작업입니다.
pt_br: Tarefas de geração remota que ainda não terminaram.
zh_hans: 尚未完成的云端生成任务。
zh_hant: 尚未完成的雲端生成任務。

# settings.about.last_error
source: Last Error
ar: آخر خطأ
de: Letzter Fehler
es: Último error
fr: Dernière erreur
ja: 直前のエラー
ko: 최근 오류
pt_br: Último erro
zh_hans: 最近错误
zh_hant: 最近錯誤

# settings.about.system
source: System
ar: النظام
es: Sistema
fr: Système
ja: システム
ko: 시스템
pt_br: Sistema
zh_hans: 系统
zh_hant: 系統

# settings.about.system.help
source: The tvOS version on this Apple TV.
ar: إصدار tvOS على Apple TV هذا.
de: Die tvOS-Version auf diesem Apple TV.
es: La versión de tvOS de este Apple TV.
fr: La version de tvOS de cet Apple TV.
ja: このApple TVのtvOSバージョンです。
ko: 이 Apple TV의 tvOS 버전입니다.
pt_br: A versão do tvOS neste Apple TV.
zh_hans: 此 Apple TV 上的 tvOS 版本。
zh_hant: 此 Apple TV 上的 tvOS 版本。

# settings.about.version
source: Version
ar: الإصدار
es: Versión
ja: バージョン
ko: 버전
pt_br: Versão
zh_hans: 版本
zh_hant: 版本

# settings.about.version.help
source: App marketing version and build number.
ar: إصدار التطبيق ورقم البناء.
de: Marketingversion und Build-Nummer der App.
es: Versión comercial y número de compilación de la app.
fr: Version commerciale et numéro de build de l’app.
ja: アプリのバージョンとビルド番号です。
ko: 앱 마케팅 버전과 빌드 번호입니다.
pt_br: Versão de marketing e número da compilação do app.
zh_hans: App 的营销版本号与构建号。
zh_hant: App 的行銷版本號與建置號。

# settings.about_diagnostics
source: About and Diagnostics
ar: حول والتشخيص
de: Info und Diagnose
es: Acerca de y diagnóstico
fr: À propos et diagnostics
ja: 情報と診断
ko: 정보 및 진단
pt_br: Sobre e diagnósticos
zh_hans: 关于与诊断
zh_hant: 關於與診斷

# settings.about_diagnostics.help
source: Version, device, and diagnostic information.
ar: معلومات الإصدار والجهاز والتشخيص.
de: Version, Gerät und Diagnoseinformationen.
es: Información de versión, dispositivo y diagnóstico.
fr: Informations de version, d’appareil et de diagnostic.
ja: バージョン、デバイス、診断情報です。
ko: 버전, 기기, 진단 정보입니다.
pt_br: Informações de versão, dispositivo e diagnóstico.
zh_hans: 版本、设备与诊断信息。
zh_hant: 版本、裝置與診斷資訊。

# settings.adjust_the_display_size_of_youtube_bilingual_subtitles_on_the_pl
source: Adjust the display size of YouTube bilingual subtitles on the play page.
ar: اضبط حجم عرض الترجمات المصاحبة ثنائية اللغة YouTube على صفحة التشغيل.
de: Passen Sie die Anzeigegröße der zweisprachigen YouTube-Untertitel auf der Wiedergabeseite an.
es: Ajuste el tamaño de visualización de los subtítulos bilingües YouTube en la página de reproducción.
fr: Ajustez la taille d'affichage des sous-titres bilingues YouTube sur la page de lecture.
ja: 再生ページのYouTube二か国語字幕の表示サイズを調整します。
ko: 재생 페이지에서 YouTube 이중 언어 자막 표시 크기를 조정합니다.
pt_br: Ajuste o tamanho de exibição das legendas bilíngues YouTube na página de reprodução.
zh_hans: 调整 YouTube 双语字幕在播放页中的显示大小。
zh_hant: 調整 YouTube 雙語字幕在播放頁中的顯示大小。

# settings.advanced
source: Advanced
ar: متقدم
de: Erweitert
es: Avanzado
fr: Avancé
ja: 詳細
ko: 고급
pt_br: Avançado
zh_hans: 高级
zh_hant: 進階

# settings.advanced.help
source: Optional object storage and TTS. Edit these on iPhone.
ar: تخزين كائنات وTTS اختياريان. عدّلهما على iPhone.
de: Optionale Objektspeicher- und TTS-Einstellungen. Bearbeiten Sie diese auf dem iPhone.
es: Almacenamiento de objetos y TTS opcionales. Edítalos en el iPhone.
fr: Stockage d’objets et TTS facultatifs. Modifiez-les sur iPhone.
ja: 任意のオブジェクトストレージとTTSです。iPhoneで編集してください。
ko: 선택적 객체 스토리지와 TTS입니다. iPhone에서 편집하세요.
pt_br: Armazenamento de objetos e TTS opcionais. Edite no iPhone.
zh_hans: 可选的对象存储与 TTS。请在 iPhone 上编辑。
zh_hant: 可選的物件儲存與 TTS。請在 iPhone 上編輯。

# settings.aliyun_oss_optional
source: Aliyun OSS (optional)
ar: Aliyun OSS(اختياري)
es: Aliyun OSS(opcional)
fr: Aliyun OSS(facultatif)
ja: Aliyun OSS(オプション)
ko: Aliyun OSS(선택사항)
pt_br: Aliyun OSS(opcional)
zh_hans: Aliyun OSS（可选）
zh_hant: Aliyun OSS（可選）

# settings.assistant_access_token
source: Assistant Access Token
ar: رمز وصول المساعد
de: Assistenten-Zugriffstoken
es: Token de acceso del asistente
fr: Jeton d’accès de l’assistant
ja: アシスタントのアクセストークン
ko: 어시스턴트 액세스 토큰
pt_br: Token de acesso do assistente
zh_hans: 助手访问令牌
zh_hant: 助手存取權杖
